In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv("Chicago.csv")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [3]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

In [4]:
chicago["Department"].nunique()

35

In [5]:
chicago["Department"].count()

32062

## Common String Methods - lower, upper, title, and len

In [6]:
chicago = pd.read_csv("Chicago.csv")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [7]:
chicago["Name"].str.lower().str.upper()

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [8]:
chicago["Name"].str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [9]:
chicago["Position Title"].str.title()

chicago["Position Title"] = chicago["Position Title"].str.title()

chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  Water Rate Taker  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    Police Officer       POLICE              $84450.00
2     AARON,  KARINA    Police Officer       POLICE              $84450.00

In [10]:
chicago["Department"].str.len()

0        11.0
1         6.0
2         6.0
3        16.0
4        11.0
         ...
32058     6.0
32059     6.0
32060     6.0
32061     4.0
32062     NaN
Name: Department, Length: 32063, dtype: float64

## The .str.replace() Method

In [11]:
chicago = pd.read_csv("Chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [12]:
chicago["Department"] = chicago["Department"].str.replace("MGMNT", "MANAGEMENT")
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00

In [13]:
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

In [14]:
chicago["Employee Annual Salary"].nlargest(10)

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
19208    195000.0
3706     187680.0
18556    187680.0
29466    187680.0
13754    185364.0
Name: Employee Annual Salary, dtype: float64

## Filtering with String Methods

In [15]:
chicago = pd.read_csv("Chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [16]:
mask = chicago["Position Title"].str.lower().str.contains("water")

chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MGMNT,$111192.00
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MGMNT,$89676.00
30544,"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MGMNT,$115704.00
30991,"WILLIAMS, MATTHEW",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
31405,"WOODRIDGE, ROBERT L",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00

In [17]:
chicago[chicago["Position Title"].str.lower().str.startswith("water")]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
1054,"ASHLEY, KARMA T",WATER CHEMIST II,WATER MGMNT,$82044.00
1079,"ATKINS, JOANNA M",WATER CHEMIST II,WATER MGMNT,$82044.00
1181,"AZEEM, MOHAMMED A",WATER CHEMIST II,WATER MGMNT,$53172.00
...,...,...,...,...
28574,"THREATT, DENISE R",WATER QUALITY INSPECTOR,WATER MGMNT,$62004.00
28602,"TIGNOR, DARRYL B",WATER RATE TAKER,WATER MGMNT,$78948.00
28955,"TRAVIS COOK, LESLIE R",WATER RATE TAKER,WATER MGMNT,$78948.00
29584,"VELAZQUEZ, JOHN",WATER RATE TAKER,WATER MGMNT,$78948.00
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MGMNT,$89676.00

In [18]:
mask = chicago["Position Title"].str.lower().str.endswith("ist")

chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,$99840.00
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,$89880.00
472,"ALLEN, ROBERT",MACHINIST,WATER MGMNT,$94328.00
705,"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,$91476.00
...,...,...,...,...
31667,"YODER, TERESA G",ARCHIVAL SPECIALIST,PUBLIC LIBRARY,$74304.00
31688,"YOUNGBLOOM, LAURENCE G",CRIMES SURVEILLANCE SPECIALIST,OEMC,$19676.80
31717,"YOUNG, KIMBERLY M",SR PROCUREMENT SPECIALIST,PROCUREMENT,$68556.00
31837,"ZAPATA, HUGO",SR PROCUREMENT SPECIALIST,PROCUREMENT,$87324.00
31918,"ZEMKE, RICHARD P",MACHINIST,AVIATION,$94328.00

## More String Methods - strip, lstrip, and rstrip

In [19]:
chicago = pd.read_csv("Chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [20]:
chicago["Name"] = chicago["Name"].str.strip().str.lstrip()

## String Methods on Index and Columns

In [21]:
chicago = pd.read_csv("Chicago.csv", index_col = "Name").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

                              Position Title Department Employee Annual Salary
Name
ZYMANTAS,  MARK E             POLICE OFFICER     POLICE              $84450.00
ZYRKOWSKI,  CARLO E           POLICE OFFICER     POLICE              $87384.00
ZYSKOWSKI,  DARIUSZ  CHIEF DATA BASE ANALYST       DoIT             $113664.00

In [22]:
chicago.index = chicago.index.str.strip().str.title()

In [23]:
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

In [24]:
chicago.columns = chicago.columns.str.upper()

In [25]:
chicago.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

## Split Strings by Characters with .str.split() Method

In [26]:
chicago = pd.read_csv("Chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [27]:
chicago["Name"].str.split(",").str.get(0).str.title().value_counts()

Williams      293
Johnson       244
Smith         241
Brown         185
Jones         183
             ...
Esparza Jr      1
Mc Neill        1
Fineman         1
Goodlet         1
Trapalis        1
Name: Name, Length: 13829, dtype: int64

In [28]:
chicago["Position Title"].str.split(" ").str.get(0).value_counts()

POLICE                 10856
FIREFIGHTER-EMT         1509
SERGEANT                1186
POOL                     918
FIREFIGHTER              810
                       ...
MANAGER-O'HARE             1
VETERINARIAN-HOURLY        1
1ST                        1
SUPT                       1
LOAN                       1
Name: Position Title, Length: 320, dtype: int64

## More Practice with Splits

In [29]:
chicago = pd.read_csv("Chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [30]:
chicago["Name"].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts().head(5)

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

## The expand and n Parameters of the .str.split() Method

In [31]:
chicago = pd.read_csv("Chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [32]:
chicago[["First Name", "Last Name"]] = chicago["Name"].str.split(",", expand = True)

In [33]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA

In [34]:
chicago[["First Word", "Second Word"]] =  chicago["Position Title"].str.split(" ", expand = True, n= 1)

In [35]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,First Word,Second Word
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA,POLICE,OFFICER

## The .dt Accessor

In [36]:
bunch_of_dates = pd.date_range(start = '2000-01-01', end= '2010-12-31', freq= '24D')

In [37]:
s=pd.Series(bunch_of_dates)
s.head(3)

0   2000-01-01
1   2000-01-25
2   2000-02-18
dtype: datetime64[ns]

In [38]:
mask = s.dt.is_quarter_start
s[mask]

0     2000-01-01
19    2001-04-01
38    2002-07-01
137   2009-01-01
dtype: datetime64[ns]

## Install pandas-datareader Library

## Import Financial Data Set with pandas_datareader Library

In [39]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

C:\Users\darko\anaconda3\envs\pandas_playground\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [40]:
stocks = data.DataReader(name='MSFT',data_source='yahoo', start='2010-01-01', end= '2020-12-31')

In [41]:
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  24.085989

In [42]:
stocks.values
stocks.columns
stocks.index
stocks.axes

[DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
                '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
                '2010-01-14', '2010-01-15',
                ...
                '2020-05-11', '2020-05-12', '2020-05-13', '2020-05-14',
                '2020-05-15', '2020-05-18', '2020-05-19', '2020-05-20',
                '2020-05-21', '2020-05-22'],
               dtype='datetime64[ns]', name='Date', length=2615, freq=None),
 Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')]

## Selecting Rows from a DataFrame with a DateTimeIndex

In [43]:
stocks = data.DataReader(name='MSFT',data_source='yahoo', start='2010-01-01', end= '2020-12-31')
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  24.085989

In [44]:
stocks.loc[pd.Timestamp('2010-01-04')]

High         3.110000e+01
Low          3.059000e+01
Open         3.062000e+01
Close        3.095000e+01
Volume       3.840910e+07
Adj Close    2.422689e+01
Name: 2010-01-04 00:00:00, dtype: float64

In [45]:
stocks.iloc[0]

High         3.110000e+01
Low          3.059000e+01
Open         3.062000e+01
Close        3.095000e+01
Volume       3.840910e+07
Adj Close    2.422689e+01
Name: 2010-01-04 00:00:00, dtype: float64

In [46]:
stocks.loc[[pd.Timestamp('2010-01-04'), pd.Timestamp('2010-01-05')]]

            High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.1  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.1  30.639999  30.850000  30.959999  49749600.0  24.234720

In [47]:
stocks.loc['2013-10-01':'2013-10-07']
stocks.truncate(before='2013-10-01', after='2013-10-07')

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  28.962389
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  29.255632
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  29.203878
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  29.221130
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  28.720888

In [48]:
birthdays=pd.date_range(start='1991-04-12', end='2020-12-31', freq=pd.DateOffset(years=1))

In [49]:
birthday_stocks=stocks.index.isin(birthdays)

In [50]:
stocks[birthday_stocks]
stocks.loc[birthday_stocks]

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2010-04-12,30.490000,30.209999,30.250000,30.320000,37068800.0,23.844728
2011-04-12,25.850000,25.549999,25.830000,25.639999,36920400.0,20.609468
2012-04-12,31.040001,30.420000,30.480000,30.980000,38304000.0,25.580429
2013-04-12,29.020000,28.660000,28.850000,28.790001,62886300.0,24.485611
2016-04-12,54.779999,53.759998,54.369999,54.650002,24944300.0,50.481159
2017-04-12,65.510002,65.110001,65.419998,65.230003,17108500.0,61.838787
2018-04-12,94.160004,92.430000,92.430000,93.580002,26758900.0,90.572739
2019-04-12,120.980003,120.370003,120.639999,120.949997,19745100.0,119.039124

## Timestamp Object Attributes and Methods

In [51]:
stocks = data.DataReader(name='MSFT',data_source='yahoo', start='2010-01-01', end= '2020-12-31')
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  24.085989

In [55]:
someday=stocks.index[500]
someday

Timestamp('2011-12-27 00:00:00')

In [57]:
someday.month
someday.week

52

In [58]:
someday.month_name()

'December'

In [59]:
stocks.index.day_name()

Index(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Monday',
       'Tuesday', 'Wednesday', 'Thursday', 'Friday',
       ...
       'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Monday',
       'Tuesday', 'Wednesday', 'Thursday', 'Friday'],
      dtype='object', name='Date', length=2615)

In [60]:
stocks.insert(0, 'day of the week',stocks.index.day_name())

In [61]:
stocks

,day of the week,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,
2010-01-04,Monday,31.100000,30.590000,30.620001,30.950001,38409100.0,24.226894
2010-01-05,Tuesday,31.100000,30.639999,30.850000,30.959999,49749600.0,24.234720
2010-01-06,Wednesday,31.080000,30.520000,30.879999,30.770000,58182400.0,24.085989
2010-01-07,Thursday,30.700001,30.190001,30.629999,30.450001,50559700.0,23.835503
2010-01-08,Friday,30.879999,30.240000,30.280001,30.660000,51197400.0,23.999893
...,...,...,...,...,...,...,...
2020-05-18,Monday,186.199997,183.960007,185.750000,184.910004,35306600.0,184.396439
2020-05-19,Tuesday,186.600006,183.490005,185.029999,183.630005,26799100.0,183.119995
2020-05-20,Wednesday,185.850006,183.940002,184.809998,185.660004,31261300.0,185.660004
2020-05-21,Thursday,186.669998,183.289993,185.399994,183.429993,29119500.0,183.429993
2020-05-22,Friday,184.460007,182.539993,183.190002,183.509995,20809700.0,183.509995

In [64]:
stocks.insert(1,'is this start of month', stocks.index.is_month_start)

In [65]:
stocks

,day of the week,is this start of month,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2010-01-04,Monday,False,31.100000,30.590000,30.620001,30.950001,38409100.0,24.226894
2010-01-05,Tuesday,False,31.100000,30.639999,30.850000,30.959999,49749600.0,24.234720
2010-01-06,Wednesday,False,31.080000,30.520000,30.879999,30.770000,58182400.0,24.085989
2010-01-07,Thursday,False,30.700001,30.190001,30.629999,30.450001,50559700.0,23.835503
2010-01-08,Friday,False,30.879999,30.240000,30.280001,30.660000,51197400.0,23.999893
...,...,...,...,...,...,...,...,...
2020-05-18,Monday,False,186.199997,183.960007,185.750000,184.910004,35306600.0,184.396439
2020-05-19,Tuesday,False,186.600006,183.490005,185.029999,183.630005,26799100.0,183.119995
2020-05-20,Wednesday,False,185.850006,183.940002,184.809998,185.660004,31261300.0,185.660004
2020-05-21,Thursday,False,186.669998,183.289993,185.399994,183.429993,29119500.0,183.429993
2020-05-22,Friday,False,184.460007,182.539993,183.190002,183.509995,20809700.0,183.509995

In [66]:
stocks[stocks['is this start of month']]

,day of the week,is this start of month,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2010-02-01,Monday,True,28.480000,27.920000,28.389999,28.410000,85931100.0,22.238642
2010-03-01,Monday,True,29.049999,28.530001,28.770000,29.020000,43805400.0,22.822367
2010-04-01,Thursday,True,29.540001,28.620001,29.350000,29.160000,74768100.0,22.932465
2010-06-01,Tuesday,True,26.309999,25.520000,25.530001,25.889999,76152400.0,20.452698
2010-07-01,Thursday,True,23.320000,22.730000,23.090000,23.160000,92239400.0,18.296041
...,...,...,...,...,...,...,...,...
2019-08-01,Thursday,True,140.940002,136.929993,137.000000,138.059998,40557500.0,136.381760
2019-10-01,Tuesday,True,140.250000,137.000000,139.660004,137.070007,21466600.0,135.854706
2019-11-01,Friday,True,144.419998,142.970001,144.259995,143.720001,33128400.0,142.445740
2020-04-01,Wednesday,True,157.750000,150.820007,153.000000,152.110001,57969900.0,151.687546
2020-05-01,Friday,True,178.639999,174.009995,175.800003,174.570007,39370500.0,174.085175

## The pd.DateOffset Object

In [67]:
stocks = data.DataReader(name='MSFT',data_source='yahoo', start='2010-01-01', end= '2020-12-31')
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  24.085989

In [69]:
stocks.index+pd.DateOffset(days=5)

DatetimeIndex(['2010-01-09', '2010-01-10', '2010-01-11', '2010-01-12',
               '2010-01-13', '2010-01-16', '2010-01-17', '2010-01-18',
               '2010-01-19', '2010-01-20',
               ...
               '2020-05-16', '2020-05-17', '2020-05-18', '2020-05-19',
               '2020-05-20', '2020-05-23', '2020-05-24', '2020-05-25',
               '2020-05-26', '2020-05-27'],
              dtype='datetime64[ns]', name='Date', length=2615, freq=None)

In [71]:
stocks.index+pd.DateOffset(days=5, months=3, hours=6, minutes=2)

DatetimeIndex(['2010-04-09 06:02:00', '2010-04-10 06:02:00',
               '2010-04-11 06:02:00', '2010-04-12 06:02:00',
               '2010-04-13 06:02:00', '2010-04-16 06:02:00',
               '2010-04-17 06:02:00', '2010-04-18 06:02:00',
               '2010-04-19 06:02:00', '2010-04-20 06:02:00',
               ...
               '2020-08-16 06:02:00', '2020-08-17 06:02:00',
               '2020-08-18 06:02:00', '2020-08-19 06:02:00',
               '2020-08-20 06:02:00', '2020-08-23 06:02:00',
               '2020-08-24 06:02:00', '2020-08-25 06:02:00',
               '2020-08-26 06:02:00', '2020-08-27 06:02:00'],
              dtype='datetime64[ns]', name='Date', length=2615, freq=None)

## Timeseries Offsets

In [72]:
stocks = data.DataReader(name='MSFT',data_source='yahoo', start='2010-01-01', end= '2020-12-31')
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720
2010-01-06  31.08  30.520000  30.879999  30.770000  58182400.0  24.085989

In [76]:
stocks.index + pd.tseries.offsets.MonthEnd()
stocks.index - pd.tseries.offsets.MonthEnd()

DatetimeIndex(['2009-12-31', '2009-12-31', '2009-12-31', '2009-12-31',
               '2009-12-31', '2009-12-31', '2009-12-31', '2009-12-31',
               '2009-12-31', '2009-12-31',
               ...
               '2020-04-30', '2020-04-30', '2020-04-30', '2020-04-30',
               '2020-04-30', '2020-04-30', '2020-04-30', '2020-04-30',
               '2020-04-30', '2020-04-30'],
              dtype='datetime64[ns]', name='Date', length=2615, freq=None)

In [75]:
stocks.tail(3)

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-05-20,185.850006,183.940002,184.809998,185.660004,31261300.0,185.660004
2020-05-21,186.669998,183.289993,185.399994,183.429993,29119500.0,183.429993
2020-05-22,184.460007,182.539993,183.190002,183.509995,20809700.0,183.509995

In [77]:
from pandas.tseries import offsets

In [78]:
stocks.index + offsets.MonthEnd()

DatetimeIndex(['2010-01-31', '2010-01-31', '2010-01-31', '2010-01-31',
               '2010-01-31', '2010-01-31', '2010-01-31', '2010-01-31',
               '2010-01-31', '2010-01-31',
               ...
               '2020-05-31', '2020-05-31', '2020-05-31', '2020-05-31',
               '2020-05-31', '2020-05-31', '2020-05-31', '2020-05-31',
               '2020-05-31', '2020-05-31'],
              dtype='datetime64[ns]', name='Date', length=2615, freq=None)

In [80]:
stocks.tail(3)

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-05-20,185.850006,183.940002,184.809998,185.660004,31261300.0,185.660004
2020-05-21,186.669998,183.289993,185.399994,183.429993,29119500.0,183.429993
2020-05-22,184.460007,182.539993,183.190002,183.509995,20809700.0,183.509995

In [79]:
stocks.index+offsets.BMonthEnd()

DatetimeIndex(['2010-01-29', '2010-01-29', '2010-01-29', '2010-01-29',
               '2010-01-29', '2010-01-29', '2010-01-29', '2010-01-29',
               '2010-01-29', '2010-01-29',
               ...
               '2020-05-29', '2020-05-29', '2020-05-29', '2020-05-29',
               '2020-05-29', '2020-05-29', '2020-05-29', '2020-05-29',
               '2020-05-29', '2020-05-29'],
              dtype='datetime64[ns]', name='Date', length=2615, freq=None)

## The Timedelta Object

In [83]:
time_a = pd.Timestamp('2010-03-31 04:30:16PM')
time_b = pd.Timestamp('2010-03-20 02:15:49AM')

time_a - time_b

Timedelta('11 days 14:14:27')

In [86]:
time_a + pd.Timedelta(days=3)

Timestamp('2010-04-03 16:30:16')

In [87]:
pd.Timedelta('8 days 3 hours 6 minutes 49 seconds')

Timedelta('8 days 03:06:49')

## Timedeltas in a Dataset

In [91]:
shipping=pd.read_csv('ecommerce.csv', index_col='ID',parse_dates=['order_date', 'delivery_date'])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [93]:
shipping['delivery_time'] = shipping['delivery_date']-shipping['order_date']
shipping.head(3)

   order_date delivery_date delivery_time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [95]:
shipping['twice_as_long'] = shipping['delivery_date']+ shipping['delivery_time']

In [96]:
shipping.head(3)

   order_date delivery_date delivery_time twice_as_long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12

In [97]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
delivery_time    timedelta64[ns]
twice_as_long     datetime64[ns]
dtype: object

In [100]:
mask=shipping['delivery_time'] > '365 days'

In [102]:
shipping[mask]

    order_date delivery_date delivery_time twice_as_long
ID
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
9   1990-01-25    1994-10-02     1711 days    1999-06-09
..         ...           ...           ...           ...
986 1990-12-10    1992-12-16      737 days    1994-12-23
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
997 1990-01-04    1991-10-03      637 days    1993-07-01

[394 rows x 4 columns]